Revit 2026 API

# VoltageTypeSet Class

---

A set that contains voltage types.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalVoltageTypeSet

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class VoltageTypeSet : APIObject,
	IEnumerable
```
```vb
Public Class VoltageTypeSet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class VoltageTypeSet : public APIObject,
	IEnumerable
```
```fsharp
type VoltageTypeSet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The VoltageTypeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | VoltageTypeSet | Initializes a new instance of the VoltageTypeSet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | Size | Returns the number of voltage types that are in the set. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every voltage type from the set, rendering it empty. |
|  | Contains | Tests for the existence of a voltage type within the set. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | Erase | Removes a specified voltage type from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Insert | Insert the specified voltage type into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Electrical Namespace